[INFO] Searching Latest checkpoint... 
[INFO] training with 1 GPU...
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 100, 40, 3)        0         
_________________________________________________________________
batch_normalization (BatchNo (None, 100, 40, 3)        12        
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 101, 41, 3)        0         
_________________________________________________________________
conv1 (Conv2D)               (None, 50, 20, 32)        864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 50, 20, 32)        128       
_________________________________________________________________
conv1_relu (ReLU)            (None, 50, 20, 32)        0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 50, 20, 32)        288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 50, 20, 32)        128       
_________________________________________________________________
conv_dw_1_relu (ReLU)        (None, 50, 20, 32)        0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 50, 20, 64)        2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 50, 20, 64)        256       
_________________________________________________________________
conv_pw_1_relu (ReLU)        (None, 50, 20, 64)        0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 51, 21, 64)        0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 25, 10, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 25, 10, 64)        256       
_________________________________________________________________
conv_dw_2_relu (ReLU)        (None, 25, 10, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 25, 10, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 25, 10, 128)       512       
_________________________________________________________________
conv_pw_2_relu (ReLU)        (None, 25, 10, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 25, 10, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 25, 10, 128)       512       
_________________________________________________________________
conv_dw_3_relu (ReLU)        (None, 25, 10, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 25, 10, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 25, 10, 128)       512       
_________________________________________________________________
conv_pw_3_relu (ReLU)        (None, 25, 10, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 26, 11, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 12, 5, 128)        1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 12, 5, 128)        512       
_________________________________________________________________
conv_dw_4_relu (ReLU)        (None, 12, 5, 128)        0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 12, 5, 256)        32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 12, 5, 256)        1024      
_________________________________________________________________
conv_pw_4_relu (ReLU)        (None, 12, 5, 256)        0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 12, 5, 256)        2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 12, 5, 256)        1024      
_________________________________________________________________
conv_dw_5_relu (ReLU)        (None, 12, 5, 256)        0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 12, 5, 256)        65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 12, 5, 256)        1024      
_________________________________________________________________
conv_pw_5_relu (ReLU)        (None, 12, 5, 256)        0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 13, 6, 256)        0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 6, 2, 256)         2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 6, 2, 256)         1024      
_________________________________________________________________
conv_dw_6_relu (ReLU)        (None, 6, 2, 256)         0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 6, 2, 512)         131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_pw_6_relu (ReLU)        (None, 6, 2, 512)         0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 6, 2, 512)         4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_dw_7_relu (ReLU)        (None, 6, 2, 512)         0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 6, 2, 512)         262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_pw_7_relu (ReLU)        (None, 6, 2, 512)         0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 6, 2, 512)         4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_dw_8_relu (ReLU)        (None, 6, 2, 512)         0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 6, 2, 512)         262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_pw_8_relu (ReLU)        (None, 6, 2, 512)         0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 6, 2, 512)         4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_dw_9_relu (ReLU)        (None, 6, 2, 512)         0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 6, 2, 512)         262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_pw_9_relu (ReLU)        (None, 6, 2, 512)         0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 6, 2, 512)         4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_dw_10_relu (ReLU)       (None, 6, 2, 512)         0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 6, 2, 512)         262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_pw_10_relu (ReLU)       (None, 6, 2, 512)         0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 6, 2, 512)         4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_dw_11_relu (ReLU)       (None, 6, 2, 512)         0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 6, 2, 512)         262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 6, 2, 512)         2048      
_________________________________________________________________
conv_pw_11_relu (ReLU)       (None, 6, 2, 512)         0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 7, 3, 512)         0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 3, 1, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 3, 1, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (ReLU)       (None, 3, 1, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 3, 1, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 3, 1, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (ReLU)       (None, 3, 1, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 3, 1, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 3, 1, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (ReLU)       (None, 3, 1, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 3, 1, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 3, 1, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (ReLU)       (None, 3, 1, 1024)        0         
_________________________________________________________________
conv2d (Conv2D)              (None, 1, 1, 4096)        12587008  
_________________________________________________________________
batch_normalization_1 (Batch (None, 1, 1, 4096)        16384     
_________________________________________________________________
dense (Dense)                (None, 1, 1, 1024)        4195328   
_________________________________________________________________
reshape (Reshape)            (None, 1024)              0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 1024)              4096      
_________________________________________________________________
dense_1 (Dense)              (None, 1251)              1282275   
_________________________________________________________________
features (Dense)             (None, 1024)              1282048   
=================================================================
Total params: 22,596,015
Trainable params: 1,282,048
Non-trainable params: 21,313,967
_________________________________________________________________
None
<bound method Network.summary of <tensorflow.python.keras.engine.training.Model object at 0x7f8158588a90>>
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
