[INFO] Searching Latest checkpoint... 
[INFO] training with 1 GPU...
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 100, 40, 3)   0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 100, 40, 3)   0                                            
__________________________________________________________________________________________________
model (Model)                   (None, 1024)         22596015    input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 1)            0           model[1][0]                      
                                                                 model[2][0]                      
==================================================================================================
Total params: 22,596,015
Trainable params: 1,282,048
Non-trainable params: 21,313,967
__________________________________________________________________________________________________
None
<bound method Network.summary of <tensorflow.python.keras.engine.training.Model object at 0x7fe0c5903da0>>
0
1
