{"keras_version": "2.1.6-tf", "class_name": "Model", "config": {"output_layers": [["dense_1", 0, 0]], "name": "model", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 201, 300, 1], "name": "input_1"}}, {"name": "concatenate", "inbound_nodes": [[["input_1", 0, 0, {}], ["input_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"dtype": "float32", "name": "concatenate", "axis": -1, "trainable": true}}, {"name": "conv1_pad", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"dtype": "float32", "name": "conv1_pad", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 32, "name": "conv1", "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv1_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv1_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_1", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_1_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_1_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 64, "name": "conv_pw_1", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_1_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_1_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"dtype": "float32", "name": "conv_pad_2", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_2", "use_bias": false, "strides": [2, 2], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_2_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_2_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 128, "name": "conv_pw_2", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_2_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_2_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_3", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_3_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_3_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 128, "name": "conv_pw_3", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_3_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_3_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"dtype": "float32", "name": "conv_pad_4", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_4", "use_bias": false, "strides": [2, 2], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_4_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_4_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 256, "name": "conv_pw_4", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_4_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_4_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_5", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_5_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_5_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 256, "name": "conv_pw_5", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_5_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_5_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"dtype": "float32", "name": "conv_pad_6", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_6", "use_bias": false, "strides": [2, 2], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_6_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_6_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 512, "name": "conv_pw_6", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_6_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_6_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_7", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_7_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_7_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 512, "name": "conv_pw_7", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_7_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_7_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_8", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_8_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_8_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 512, "name": "conv_pw_8", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_8_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_8_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_9", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_9_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_9_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 512, "name": "conv_pw_9", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_9_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_9_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_10", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_10_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_10_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 512, "name": "conv_pw_10", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_10_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_10_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_11", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_11_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_11_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 512, "name": "conv_pw_11", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_11_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_11_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"dtype": "float32", "name": "conv_pad_12", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_12", "use_bias": false, "strides": [2, 2], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_12_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_12_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 1024, "name": "conv_pw_12", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_12_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_12_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "depthwise_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "name": "conv_dw_13", "use_bias": false, "strides": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_13_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_dw_13_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 1024, "name": "conv_pw_13", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "kernel_constraint": null, "use_bias": false, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_13_bn", "gamma_constraint": null, "beta_constraint": null}}, {"name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "conv_pw_13_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}}, {"name": "global_average_pooling2d", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"dtype": "float32", "name": "global_average_pooling2d", "data_format": "channels_last", "trainable": true}}, {"name": "dense", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]], "class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "units": 1024, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "units": 1251, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}]}, "backend": "tensorflow"}