{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 100, 40, 3]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"dtype": "float32", "trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv1_pad", "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv1", "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [2, 2], "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv1_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv1_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_1", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_1_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_1", "kernel_size": [1, 1], "filters": 64, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_1_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"dtype": "float32", "trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv_pad_2", "data_format": "channels_last"}, "name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_2", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [2, 2], "padding": "valid", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_2_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_2", "kernel_size": [1, 1], "filters": 128, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_2_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_3", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_3_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_3", "kernel_size": [1, 1], "filters": 128, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_3_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"dtype": "float32", "trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv_pad_4", "data_format": "channels_last"}, "name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_4", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [2, 2], "padding": "valid", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_4_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_4_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_4", "kernel_size": [1, 1], "filters": 256, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_4_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_4_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_5", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_5_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_5_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_5", "kernel_size": [1, 1], "filters": 256, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_5_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_5_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"dtype": "float32", "trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv_pad_6", "data_format": "channels_last"}, "name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_6", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [2, 2], "padding": "valid", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_6_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_6_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_6", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_6_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_6_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_7", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_7_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_7_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_7", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_7_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_7_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_8", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_8_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_8_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_8", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_8_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_8_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_9", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_9_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_9_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_9", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_9_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_9_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_10", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_10_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_10_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_10", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_10_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_10_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_11", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_11_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_11_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_11", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_11_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_11_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"dtype": "float32", "trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv_pad_12", "data_format": "channels_last"}, "name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_12", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [2, 2], "padding": "valid", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_12_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_12_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_12", "kernel_size": [1, 1], "filters": 1024, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_12_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_12_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv_dw_13", "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false}, "name": "conv_dw_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_dw_13_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_dw_13_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv_pw_13", "kernel_size": [1, 1], "filters": 1024, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "conv_pw_13_bn", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"dtype": "float32", "trainable": true, "negative_slope": 0.0, "name": "conv_pw_13_relu", "threshold": 0.0, "max_value": 6.0}, "name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d", "kernel_size": [3, 1], "filters": 4096, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "padding": "valid", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [3], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 1024, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "use_bias": true}, "name": "dense", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"dtype": "float32", "trainable": true, "name": "reshape", "target_shape": [1024]}, "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": [1], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "beta_constraint": null, "dtype": "float32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_2", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 1251, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "dtype": "float32", "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "use_bias": true}, "name": "dense_1", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 1024, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "features", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "use_bias": true}, "name": "features", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["features", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model"}, "keras_version": "2.1.6-tf"}