{"backend": "tensorflow", "config": {"output_layers": [["lambda", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 100, 40, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 100, 40, 3], "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "Model", "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]], "config": {"output_layers": [["features", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model", "layers": [{"config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 100, 40, 3]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization"}, {"config": {"trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "name": "conv1_pad", "dtype": "float32"}, "inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv1_pad"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv1", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv1"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv1_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv1_bn"}, {"config": {"threshold": 0.0, "name": "conv1_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv1_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_1", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_1"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_1_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_1_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_1_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_1_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_1", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_1"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_1_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_1_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_1_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_1_relu"}, {"config": {"trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "name": "conv_pad_2", "dtype": "float32"}, "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv_pad_2"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_2", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [2, 2], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "valid", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_2"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_2_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_2_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_2_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_2_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_2", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_2"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_2_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_2_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_2_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_2_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_3", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_3"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_3_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_3_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_3_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_3_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_3", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_3"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_3_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_3_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_3_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_3_relu"}, {"config": {"trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "name": "conv_pad_4", "dtype": "float32"}, "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv_pad_4"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_4", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [2, 2], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "valid", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_4"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_4_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_4_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_4_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_4_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_4", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_4"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_4_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_4_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_4_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_4_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_5", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_5"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_5_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_5_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_5_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_5_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_5", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_5"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_5_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_5_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_5_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_5_relu"}, {"config": {"trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "name": "conv_pad_6", "dtype": "float32"}, "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv_pad_6"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_6", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [2, 2], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "valid", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_6"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_6_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_6_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_6_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_6_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_6", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_6"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_6_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_6_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_6_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_6_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_7", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_7"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_7_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_7_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_7_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_7_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_7", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_7"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_7_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_7_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_7_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_7_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_8", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_8"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_8_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_8_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_8_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_8_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_8", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_8"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_8_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_8_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_8_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_8_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_9", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_9"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_9_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_9_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_9_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_9_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_9", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_9"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_9_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_9_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_9_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_9_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_10", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_10"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_10_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_10_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_10_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_10_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_10", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_10"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_10_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_10_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_10_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_10_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_11", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_11"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_11_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_11_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_11_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_11_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_11", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_11"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_11_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_11_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_11_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_11_relu"}, {"config": {"trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "name": "conv_pad_12", "dtype": "float32"}, "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv_pad_12"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_12", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [2, 2], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "valid", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_12"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_12_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_12_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_12_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_12_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_12", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_12"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_12_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_12_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_12_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_12_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_13", "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "strides": [1, 1], "depth_multiplier": 1, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": false, "bias_constraint": null}, "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_13"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_dw_13_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_13_bn"}, {"config": {"threshold": 0.0, "name": "conv_dw_13_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_13_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_13", "activation": "linear", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "bias_regularizer": null, "use_bias": false, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_13"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv_pw_13_bn", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_13_bn"}, {"config": {"threshold": 0.0, "name": "conv_pw_13_relu", "max_value": 6.0, "trainable": true, "negative_slope": 0.0, "dtype": "float32"}, "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_13_relu"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d", "activation": "relu", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "dtype": "float32", "filters": 4096, "kernel_size": [3, 1], "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_1", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense", "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 1024, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense"}, {"config": {"trainable": true, "target_shape": [1024], "name": "reshape", "dtype": "float32"}, "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape"}, {"config": {"momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_2", "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "axis": [1], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_1", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "units": 1251, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "features", "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 1024, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "features"}]}, "name": "model"}, {"class_name": "Lambda", "inbound_nodes": [[["model", 1, 0, {}], ["model", 2, 0, 